add mermaid diagram in readme
